MHML2018/nrf52-ble/main.c

#include <stdint.h>
#include <string.h>
#include "nordic_common.h"
#include "nrf.h"
#include "app_error.h"
#include "ble.h"
#include "ble_hci.h"
#include "ble_srv_common.h"
#include "ble_advdata.h"
#include "ble_advertising.h"
#include "ble_conn_params.h"
#include "boards.h"
#include "softdevice_handler.h"
#include "app_timer.h"
#include "device_manager.h"
#include "pstorage.h"
#include "app_trace.h"
#include "bsp.h"
#include "bsp_btn_ble.h"
#include "posture_service.h"
#include "feedback_service.h"

#define IS_SRVC_CHANGED_CHARACT_PRESENT  1                                          /**< Include or not the service_changed characteristic. if not enabled, the server's database cannot be changed for the lifetime of the device*/

#define CENTRAL_LINK_COUNT               0                                          /**<number of central links used by the application. When changing this number remember to adjust the RAM settings*/
#define PERIPHERAL_LINK_COUNT            1                                          /**<number of peripheral links used by the application. When changing this number remember to adjust the RAM settings*/

#define DEVICE_NAME                      "SitRight"                          /**< Name of device. Will be included in the advertising data. */
#define APP_ADV_INTERVAL                 300                                        /**< The advertising interval (in units of 0.625 ms. This value corresponds to 25 ms). */
#define APP_ADV_TIMEOUT_IN_SECONDS       180                                        /**< The advertising timeout in units of seconds. */

#define APP_TIMER_PRESCALER              0                                          /**< Value of the RTC1 PRESCALER register. */
#define APP_TIMER_OP_QUEUE_SIZE          4                                          /**< Size of timer operation queues. */

#define MIN_CONN_INTERVAL                MSEC_TO_UNITS(50, UNIT_1_25_MS)           /**< Minimum acceptable connection interval (0.1 seconds). */
#define MAX_CONN_INTERVAL                MSEC_TO_UNITS(100, UNIT_1_25_MS)           /**< Maximum acceptable connection interval (0.2 second). */
#define SLAVE_LATENCY                    0                                          /**< Slave latency. */
#define CONN_SUP_TIMEOUT                 MSEC_TO_UNITS(4000, UNIT_10_MS)            /**< Connection supervisory timeout (4 seconds). */

#define FIRST_CONN_PARAMS_UPDATE_DELAY   APP_TIMER_TICKS(5000, APP_TIMER_PRESCALER) /**< Time from initiating event (connect or start of notification) to first time sd_ble_gap_conn_param_update is called (5 seconds). */
#define NEXT_CONN_PARAMS_UPDATE_DELAY    APP_TIMER_TICKS(30000, APP_TIMER_PRESCALER)/**< Time between each call to sd_ble_gap_conn_param_update after the first call (30 seconds). */
#define MAX_CONN_PARAMS_UPDATE_COUNT     3                                          /**< Number of attempts before giving up the connection parameter negotiation. */

#define SEC_PARAM_BOND                   1                                          /**< Perform bonding. */
#define SEC_PARAM_MITM                   0                                          /**< Man In The Middle protection not required. */
#define SEC_PARAM_IO_CAPABILITIES        BLE_GAP_IO_CAPS_NONE                       /**< No I/O capabilities. */
#define SEC_PARAM_OOB                    0                                          /**< Out Of Band data not available. */
#define SEC_PARAM_MIN_KEY_SIZE           7                                          /**< Minimum encryption key size. */
#define SEC_PARAM_MAX_KEY_SIZE           16                                         /**< Maximum encryption key size. */

#define DEAD_BEEF                        0xDEADBEEF                                 /**< Value used as error code on stack dump, can be used to identify stack location on stack unwind. */

static dm_application_instance_t        m_app_handle;                               /**< Application identifier allocated by device manager */

static uint16_t                          m_conn_handle = BLE_CONN_HANDLE_INVALID;   /**< Handle of the current connection. */

// FROM_SERVICE_TUTORIAL: Declare a service structure for our application
ble_ps_t m_posture_service;
ble_fbs_t m_feedback_service;

// OUR_JOB: Step 3.G, Declare an app_timer id variable and define our timer interval and define a timer interval
APP_TIMER_DEF(m_pressure_char_timer_id);
#define PRESSURE_CHAR_TIMER_INTERVAL     APP_TIMER_TICKS(500, APP_TIMER_PRESCALER) // 1000 ms intervals
APP_TIMER_DEF(m_accel_char_timer_id);
#define ACCEL_CHAR_TIMER_INTERVAL     APP_TIMER_TICKS(500, APP_TIMER_PRESCALER) // 1000 ms intervals

static ble_uuid_t       m_adv_uuids[] = {{BLE_UUID_POSTURE_SERVICE_UUID, BLE_UUID_TYPE_VENDOR_BEGIN}}; 
                                   
/**@brief Callback function for asserts in the SoftDevice.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyze
 *          how your product is supposed to react in case of Assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in] line_num   Line number of the failing ASSERT call.
 * @param[in] file_name  File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
{
    app_error_handler(DEAD_BEEF, line_num, p_file_name);
}


//Simulate some fake pressure data for the two classes

    uint8_t simButt[5][18]           = {{0x12, 0x34, 0x56, 0x78, 0x90, 0xCA,0xFE, 0xF0, 0x0D, 0xC0, 0xFF, 0xEE, 0xBE, 0xEF, 0x87, 0x65, 0x43, 0x21},\
                                    {0x12, 0x34, 0x56, 0x78, 0x90, 0xCA,0xFE, 0xF0, 0x0D, 0xC0, 0xFF, 0xEE, 0xBE, 0xEF, 0x87, 0x65, 0x43, 0x21},\
                            {0x12, 0x34, 0x56, 0x78, 0x90, 0xCA,0xFE, 0xF0, 0x0D, 0xC0, 0xFF, 0xEE, 0xBE, 0xEF, 0x87, 0x65, 0x43, 0x21},\
                            {0x12, 0x34, 0x56, 0x78, 0x90, 0xCA,0xFE, 0xF0, 0x0D, 0xC0, 0xFF, 0xEE, 0xBE, 0xEF, 0x87, 0x65, 0x43, 0x21},\
                            {0x12, 0x34, 0x56, 0x78, 0x90, 0xCA,0xFE, 0xF0, 0x0D, 0xC0, 0xFF, 0xEE, 0xBE, 0xEF, 0x87, 0x65, 0x43, 0x21}};\


    uint8_t simBack[5][8]           = {{0x12,0x34,0x56,0x78,0x90,0x00,0x13,0x37},\
                                        {0x12,0x34,0x56,0x78,0x90,0x00,0x13,0x37},\
                                        {0x12,0x34,0x56,0x78,0x90,0x00,0x13,0x37},\
                                        {0x12,0x34,0x56,0x78,0x90,0x00,0x13,0x37},\
                                        {0x12,0x34,0x56,0x78,0x90,0x00,0x13,0x37}};



//Global Circular Buffer for averaging sensor readings
#define CIRCULAR_BUFFER_SIZE 16
#define NUM_BUTT_SENSORS 9
#define NUM_BACK_SENSORS 4
#define NUM_SIM_DATA 5
#define NUM_MUX_OUTPUTS sizeof(muxPins)/sizeof(muxPins[0]);
#define NUM_BACK_COLS sizeof(backColPins)/sizeof(backColPins[0]);
#define NUM_BACK_COLS sizeof(buttColPins)/sizeof(buttColPins[0]);


uint16_t buttBuffer[CIRCULAR_BUFFER_SIZE][9] = {0};

uint16_t backBuffer[CIRCULAR_BUFFER_SIZE][4] = {0};

uint32_t muxPins[3] = {NRF_GPIO_PIN_MAP(1,3),\
                        NRF_GPIO_PIN_MAP(1,2),\
                        NRF_GPIO_PIN_MAP(1,1)};

uint32_t backColPins[2] = { NRF_GPIO_PIN_MAP(1,12),\
                            NRF_GPIO_PIN_MAP(1,13)};

uint32_t buttColPins[3] = { NRF_GPIO_PIN_MAP(1,4),\
                            NRF_GPIO_PIN_MAP(1,5),\
                            NRF_GPIO_PIN_MAP(1,6)};


static inline void select_mux(uint8_t output){
    if(output>NUM_MUX_OUTPUTS){
        //Silently throw error
        return;
    }
    for(size_t i=0;i<NUM_MUX_OUPUTS/2;i++){
        nrf_gpio_pin_write(muxPins[i], output & 1<<i);
    }
}

static inline void select_back_col(uint8_t output){
    if(output>sizeof(backColPins)){
        //Silently throw error
        return;
    }
    for(size_t i=0; i<sizeof(backColPins); i++){
        if(output == i){
            nrf_gpio_pin_set(backColPins[i]);
        }
        else{
            nrf_gpio_pin_clear(backColPins[i]);
        }
    }
    return;
}

