MHML2018/nrf52-ble/main.c
static inline void select_butt_col(uint8_t output){
    if(output>sizeof(buttColPins)){
        //Silently throw error
        return;
    }
    for(size_t i=0; i<sizeof(buttColPins); i++){
        if(output == i){
            nrf_gpio_pin_set(buttColPins[i]);
        }
        else{
            nrf_gpio_pin_clear(buttColPins[i]);
        }
    }
    return;
}

static void chair_gpio_init(){
    for(size_t i=0; i<sizeof(muxPins); i++){
        nrf_gpio_cfg_default(muxPins[i]);
        nrf_gpio_cfg_output(muxPins[i]);
    }
    
    for(size_t i=0; i<sizeof(backColPins); i++){
        nrf_gpio_cfg_default(backColPins[i]);
        nrf_gpio_cfg_output(backColPins[i]);
    }

    for(size_t i=0; i<sizeof(buttColPins); i++){
        nrf_gpio_cfg_default(buttColPins[i]);
        nrf_gpio_cfg_output(buttColPins[i]);
    }
}


static void pressure_timer_timeout_handler(void * p_context)
{
    //Create/increment simulated posture
    i++;
    i = i%NUM_SIM_DATA;
    static size_t i=0; 
    uint8_t buttValue[2*NUM_BUTT_SENSORS]={0};
    uint8_t backValue[2*NUM_BACK_SENSORS]={0};
    //Simulate data
    memcpy(&buttValue, simButt[i], sizeof(buttValue));
    memset(&backValue, simBack[i], sizeof(backValue)); 

    //Alernatively, average circular buffer of sensor data
    for(size_t k; k<NUM_BUTT_SENSORS; k++){
        for(size_t j; j<CIRCULAR_BUFFER_SIZE;j++){
                buttValue[k] += buttBuffer[j][k]/CIRCULAR_BUFFER_SIZE;
        }
    }
    for(size_t k; k<NUM_BACK_SENSORS; k++){
        for(size_t j; j<CIRCULAR_BUFFER_SIZE;j++){
                backValue[k] += backBuffer[j][k]/CIRCULAR_BUFFER_SIZE;
        }
    }

    //Push values to phone
    pressure_characteristic_update(&m_posture_service, &buttValue[0]);
    accel_characteristic_update(&m_posture_service, &backValue[0]);

    //Blinky light to show it's working
    nrf_gpio_pin_toggle(LED_4);
}


static void accel_timer_timeout_handler(void * p_context)
{
    //Create/increment index for circular buffer
    static size_t i = 0;
    i++;
    i = i%CIRCULAR_BUFFER_SIZE;

    //Sample the sensors here
    //
    //
    //Do maths here
    //
    //
    //
    //for numberOfSensors{
    //buttBuffer[i][sensorNumber]=analogRead(sensorNumber)
    //backBuffer[i][sensorNumber]=analogRead(sensorNumber)
    //}
    
    //Blinky light ot show it's happening
    nrf_gpio_pin_toggle(LED_2);
}

/**@brief Function for the Timer initialization.
 *
 * @details Initializes the timer module. This creates and starts application timers.
 */
static void timers_init(void)
{

    // Initialize timer module.
    APP_TIMER_INIT(APP_TIMER_PRESCALER, APP_TIMER_OP_QUEUE_SIZE, false);

    // OUR_JOB: Step 3.H, Initiate our timer
    app_timer_create(&m_pressure_char_timer_id, APP_TIMER_MODE_REPEATED, pressure_timer_timeout_handler);
    app_timer_create(&m_accel_char_timer_id, APP_TIMER_MODE_REPEATED, accel_timer_timeout_handler);
}


/**@brief Function for the GAP initialization.
 *
 * @details This function sets up all the necessary GAP (Generic Access Profile) parameters of the
 *          device including the device name, appearance, and the preferred connection parameters.
 */
static void gap_params_init(void)
{
    uint32_t                err_code;
    ble_gap_conn_params_t   gap_conn_params;
    ble_gap_conn_sec_mode_t sec_mode;

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

    err_code = sd_ble_gap_device_name_set(&sec_mode,
                                          (const uint8_t *)DEVICE_NAME,
                                          strlen(DEVICE_NAME));
    APP_ERROR_CHECK(err_code);

    memset(&gap_conn_params, 0, sizeof(gap_conn_params));

    gap_conn_params.min_conn_interval = MIN_CONN_INTERVAL;
    gap_conn_params.max_conn_interval = MAX_CONN_INTERVAL;
    gap_conn_params.slave_latency     = SLAVE_LATENCY;
    gap_conn_params.conn_sup_timeout  = CONN_SUP_TIMEOUT;

    err_code = sd_ble_gap_ppcp_set(&gap_conn_params);
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for initializing services that will be used by the application.
 */
static void services_init(void)
{
    // FROM_SERVICE_TUTORIAL: Add code to initialize the services used by the application.
    posture_service_init(&m_posture_service);    
    feedback_service_init(&m_feedback_service);
}


/**@brief Function for handling the Connection Parameters Module.
 *
 * @details This function will be called for all events in the Connection Parameters Module which
 *          are passed to the application.
 *          @note All this function does is to disconnect. This could have been done by simply
 *                setting the disconnect_on_fail config parameter, but instead we use the event
 *                handler mechanism to demonstrate its use.
 *
 * @param[in] p_evt  Event received from the Connection Parameters Module.
 */
static void on_conn_params_evt(ble_conn_params_evt_t * p_evt)
{
    uint32_t err_code;

    if (p_evt->evt_type == BLE_CONN_PARAMS_EVT_FAILED)
    {
        err_code = sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_CONN_INTERVAL_UNACCEPTABLE);
        APP_ERROR_CHECK(err_code);
    }
}


/**@brief Function for handling a Connection Parameters error.
 *
 * @param[in] nrf_error  Error code containing information about what went wrong.
 */
static void conn_params_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}


/**@brief Function for initializing the Connection Parameters module.
 */
static void conn_params_init(void)
{
    uint32_t               err_code;
    ble_conn_params_init_t cp_init;

    memset(&cp_init, 0, sizeof(cp_init));

    cp_init.p_conn_params                  = NULL;
    cp_init.first_conn_params_update_delay = FIRST_CONN_PARAMS_UPDATE_DELAY;
    cp_init.next_conn_params_update_delay  = NEXT_CONN_PARAMS_UPDATE_DELAY;
    cp_init.max_conn_params_update_count   = MAX_CONN_PARAMS_UPDATE_COUNT;
    cp_init.start_on_notify_cccd_handle    = BLE_GATT_HANDLE_INVALID;
    cp_init.disconnect_on_fail             = false;
    cp_init.evt_handler                    = on_conn_params_evt;
    cp_init.error_handler                  = conn_params_error_handler;

